import numpy as np

A = np.array([
    [10, 14, 16, 13, 29, -3, -3, 0, 0, 0],
    [-7, 2, 8, 18, 12, 25, 13, 0, 0, 0],
    [23, 21, 21, 18, 8, 1, 11, -1, 0, 0],
    [2, 16, 6, 24, 3, 16, 25, 0, -1, 0],
    [13, 4, 11, 1, -7, 8, -9, 0, 0, 1]
])

B = np.array([81, 75, 98, 85, 29])

# Выделяем подматр<LeftRelease>ицу 5x5
A_sub = A[:, :5]

try:
    # Находим обратную матрицу. Если матрица вырожденная, возникнет исключение.
    A_inv = np.linalg.inv(A_sub)
    result = np.dot(A_inv, B)
    print("Matrix: ", A_inv)
    print("Результат:", result)

    # Проверяем на неотрицательность
    if np.all(result >= 0):
        print("Все элементы неотрицательны.")
    else:
        print("Есть отрицательные элементы в результате.")

except np.linalg.LinAlgError:
    print("Обратной матрицы не существует (матрица вырожденная).")

''' D
10 14 13 29 -3
-7 2  18 12 25
23 21 18 8  1
2  16 24 3  16
13 4  1 -7  8
'''
''' 

'''

